app/views/posts/show.html.erb

SELECT COUNT(comments) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 2]]
---
<div class="comments">
	<h2><%= pluralize @post.comments.count, "comment" %></h2>