app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "comments" ("name", "body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "11"], ["body", "1"], ["post_id", 2], ["created_at", "2015-11-17 04:49:07.944915"], ["updated_at", "2015-11-17 04:49:07.944915"]]
---
	def create
		@post = Post.find(post_id_params)
		@comment = @post.comments.create(comment_params)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ? LIMIT 1  [["post_id", 2], ["id", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]
---
	def destroy
		@post = Post.find(post_id_params)
		@comment = @post.comments.find(params[:id])
		@comment.destroy