app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"  ORDER BY created_at DESC
---
	def index
		@posts = Post.all.order("created_at DESC")

INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "asdf"], ["body", ""], ["created_at", "2015-11-16 06:42:05.854447"], ["updated_at", "2015-11-16 06:42:05.854447"]]
---
	def create
		@post = Post.new(post_params)
		if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "posts" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "asdf1"], ["body", "Updated"], ["updated_at", "2015-11-17 02:55:21.593520"], ["id", 1]]
---
	def update
		@post = Post.find(params[:id])

		if @post.update(post_params)